#include<stdio.h>
int main()
{
	//int a = 3;//正数的原码，反码，补码相同
	//int b = -5;
	//int c = a & b;
	////&-按位（二进制）与//int（32位）两个补码有0则为0，都是1才为1（0优先）
	////|-按位（二进制）或//有1则为1，两个同时为0才是0（1优先）
	////^-按（二进制）位异或-//相同为0，相异为1.（都只能用整形）
	////00000000000000000000000000000011 3的补码
	////10000000000000000000000000000011 -3的补码
	////第一个是符号位0为正，1为负
	//printf("c=%d\n", c);//%d 意味着打印一个有符号的整数（要源码）-1再取反（负数）
	//return 0;
	//面试题：不创建临时变量，实现两个数的交换（用法）//有点恶心
	int a = 3;
	int b = 5;//把a和b交换（不创建临时变量）
	//解法1：
	printf("交换前：a=%d b=%d\n", a, b);
	//a = a + b;
	//b = a - b;
	//a = a - b;//巧妙赋值（但是int类型有最大值，如果a,b太大会导致栈溢出）缺点
	//解法2：(用异或）(高级）
	a = a ^ b;//a=3^5
	b = a ^ b;//3^5^5=3……》b=3
	a = a ^ b;//3^5^3……》a=5(nb)
	printf("交换后：a=%d b=%d\n", a, b);
}
//解释：3^3 = 0
     //011
     //011
     //000 所以答案为0
     //0^5 = 5 -> 0^a = a
     //000
     //101
     //101 答案还是5
     //3^3^5 = 5
     //3^5^3 = 5(还是5）
//结论：异或满足交换律