//1： 利用 sinx≈x−x……（泰勒公式）

//相关知识
//为了完成本关任务，你需要掌握：
//
//数列中某一项的推导；
//数列前n项的累加和；
//操作提示
//后项的分子是其前项的分子乘上 - x²；
//若前项的分母为d，后项的分母为d×(n + 1)×(n + 2)，且n值按步长为2递增；
//若前项为temp，则后项为 - temp * x * x / ((n + 1) * (n + 2))。
//编程要求
//根据提示在右侧编辑器Begin--End之间的区域内补充必要的代码，利用循环结构语句求解出sinx的值；不能直接调用sin()函数实现。
//
//测试说明
//平台会对你编写的代码进行测试：
//
//测试输入：1.57；
//预期输出：
//利用求和公式计算sin(1.570000) = 1.000000
//为了对比，此处调用标准函数库中的sin函数计算sin(1.570000) = 1.000000
/*利用sinx≈x - x^3/3！ + x^5/5！-  x^7/7！ + x^9/9！ -……，计算sinx的值，直到最后一项的绝对值小于10^-5*/
//#include<stdio.h>
//#include<math.h>
//main() {
//    double t, sum, x;
//    int n;
//    scanf("%lf", &x);
//    sum = x;
//    /************************begin***********************/
//    t = x;
//    for (n = 1; 1; n = n + 2)
//    {
//
//        t = -t * (x * x) / ((n + 1) * (n + 2));
//        sum += t;
//        if (t > 0)
//        {
//            if (t < 1e-20)
//                break;
//        }
//        else if (t < 0)
//        {
//            if (-t < 1e-20)
//                break;
//        }
//
//    }
//
//    /************************end************************/
//    printf("利用求和公式计算sin(%lf)=%lf\n", x, sum);
//    printf("为了对比，此处调用标准函数库中的sin函数计算sin(%lf)=%lf\n", x, sin(x));
//}
//2./*求两个正整数的最大公约数。*/
//#include "stdio.h"
//main() {
//    int m, n, r;
//    scanf("%d %d", &m, &n);
//    /************************begin***********************/
//    while (1)
//    {
//        if (m % n == 0)
//        {
//            break;
//        }
//        if (m % n != 0)
//        {
//            r = m % n;
//            m = n;
//            n = r;
//        }//一定会有这个数，所以只在算出的地方设置跳出
//    }
//
//    /************************end************************/
//    printf("求出的最大公约数是%d", n);
//}
/*3. 在海军节开幕式上，有A、B、C三艘军舰要同时开始鸣放礼炮各21响。已知A舰每隔5秒1次，B舰每隔6秒放1次，C舰每隔7秒放1次。假设各炮手对时间的掌握非常准确，请编程计算观众总共以听到几次礼炮
声。*///0秒时同时开炮
#include <stdio.h>
main() {
    int n = 0, t = -1;
    /************************begin***********************/
    while (t <= 20 * 7)
    {
        t++;
        if (t % 5 == 0 && t <= 20 * 5)
        {
            n++;
            continue;
        }
        if (t % 6 == 0 && t <= 20 * 6)
        {
            n++;
            continue;
        }
        if (t % 7 == 0)
        {
            n++;
            continue;
        }
    }

    printf("n=%d\n", n);
}
//continue语句的最好使用场景