//表达式求值（进阶）
#include<stdio.h>
//int main()
//{
//	int a = 2 + 6 / 3;//优先级（先算/，在算+）
//	int b = 2 + 2 + 3;//每个符号有自己的结合性（+是从左向右）//这个要查表格
//	return 0;
//}
// 整形提升：(按照符号位来提升）（因为在cpu计算时是一int型来计算的）
//int main()
//{
//	char a = 5;
//	char b = 126;
//	char c = a + b;//隐式类型转换，在计算时字符型和短整型会转化成int型（这个叫做整形提升）
//	printf("%d\n", c);
//	return 0;
//}
//int main()
//{
//	char c = -1;//-1是整数，32个比特位（X86)环境4*8
//	//1000000000000000000000000000000001-》原码
//	//1111111111111111111111111111111110-》反码
//	//1111111111111111111111111111111111-》补码（-1）
//	//11111111 -c//因为char存不下int所以只能存下后8位
//	//1111111111111111111111111111111111因为符号为为1，所以补一（整形提升）如果是无符号整形直接补0
//	printf("%d\n", c);
//	return 0;
//}
//int main()
//{//
//	char a = 5;
//	//00000000000000000000000000000101-》5的二进制序列，char放不下
//	//00000101//同理：符号位为0，补0
//	//00000000000000000000000000000101
//	char b = 126;
//	//00000000000000000000000011111110
//	//01111110-》126
//	//a+b
//	//00000000000000000000000000000101->a
//	//00000000000000000000000001111110->b//提升后
//	//00000000000000000000000010000011-》a+b
//	//10000011->c//发现符号位变成了1
//	//11111111111111111111111110000011-》补码
//	//11111111111111111111111110000010
//	//10000000000000000000000001111101-原码
//	char c = a + b;//隐式类型转换，在计算时字符型和短整型会转化成int型（这个叫做整形提升）
//	printf("%d\n", c);//-125
//	return 0;
//}
//举例一：
//int main()
//{
//	char a = 0xb6;
//	short b = 0xb600;
//	int c = 0xb6000000;
//	if (a == 0xb6)
//	{
//		printf("a");
//	}
//	if (b == 0xb600)
//	{
//		printf("b");
//	}
//	if (c == 0xb6000000)
//	{
//		printf("c");
//	}//结果是只会打印c(有整形提升）
//	return 0;
//}
////举例二：
//int main()
//{
//	char c = 1;
//	printf("%u\n", sizeof(c));//1
//	printf("%u\n", sizeof(+c));//4//为什么呢？//-+号是运算符，运算时会整形提升
//	printf("%u\n", sizeof(-c));//4
//	return 0;
//}
//相反的情况：算数转换//算数时，空间不够。
//就会转化成空间更大的类型  如：int 转化成 long int
//问题表达式：1
//a*b+c*d+e*f
//1 3 2 5 4//执行顺序
//1 4 2 5 3//有两种（不缺点）这种就是问题表达式
//问题表达式：2
//c + --c
//这里有一个很细的问题
//假设：c=2
//1.c先准备（放到寄存器里）好了是2，然后--c就变成了1 得出3
//2.c没有准备好，得出的就是2
//问题表达式：3
//int main()
//{
//	int i = 10;
//	i = i-- - --i * (i = -3) * i++ + ++i;
//	printf("i = %d\n", i);
//	return 0;
//}//通过十几种编译器去计算 算出11种不同的值
//这东西谁敢用？？？
//static //创建后不会销毁
//问题表达式：4
//int fun()
//{
//	static int count = 1; //static //创建后不会销毁
//	return ++count;
//}
//int main()
//{
//	int answer;
//	answer = fun() + fun() * fun();
//	printf("%d\n", answer);//输出多少？//没法求，你不知道这三个fun先算那个
//	return 0；
//}
int main()
{
	int a = 1;
	int b = (++a) + (++a) + (++a);
	//要了解原理就看汇编语言 ebp，eax,ecx,ebx,edx是寄存器
	printf("%d\n", b);//12（vs环境下）10(linix)
	return 0;
}//学校还老是考

